/**
 * 基础目录
 */

// 社保药品目录
export const aka036 = {  // 限制使用标记
  0: '否',
  1: '是'
}

export const bkm100 = {  // 限医院级别
  10: '限二级及以上',
  11: '限三级'
}

export const bkm101 = {  // 限医疗机构类别
  10: '限综合医院',
  11: '限专科医院'
}

export const bkm102 = {  // 限肿瘤
  10: '限肿瘤',
  11: '限精神病'
}

export const bkm032 = {  // 记账标志
  '01': '基本记帐',
  '02': '补充记帐',
  99: '自费'
}

export const aka031 = {  // 药品类别
  1: '西药',
  2: '中成药',
  3: '中药饮片',
  4: '中药颗粒'
}

export const ckm102 = {  // 医保谈判价格所属行政级别
  1: '国家',
  2: '广东省',
  3: '深圳市'
}

// 社保诊疗目录
export const bkm031 = {  // 诊疗项目类别
  1: '综合医疗服务',
  2: '医技诊疗',
  3: '临床诊疗及手术项目类',
  4: '中医及民族医诊疗',
  9: '其它'
}

// 社保材料目录
export const ake004 = {  // 产地标志
  1: '国内',
  2: '国外'
}


// 社保疾病目录
export const bkm072 = {  // 偿付周期
  1: '天',
  2: '周',
  3: '月',
  4: '季度',
  5: '半年',
  6: '年',
  7: '例数'
}

// 医疗套餐目录
export const bkm077 = {  // 套餐类别
  1: '门诊大病',
  2: '门诊特检'
}

export const ake003 = {  // 目录类别
  1: '药品',
  2: '诊疗',
  3: '材料'
}

// 医药机构目录备案(申请)查询
export const baa201 = {  // 目录申请状态
  0: '审批中',
  1: '审批通过',
  2: '审批不通过'
}

export const aae016 = {  // 办结状态
  0: '未办结',
  1: '已办结'
}

export const bkf222 = {  // 约定状态
  0: '非约定',
  1: '约定',
  2: '暂停',
  3: '取消'
}

export const aka070 = {  // 剂型类别
  A001: '片剂',
  A002: '含片',
  A003: '舌下片',
  A004: '口腔贴片',
  A005: '咀嚼片',
  A006: '分散片',
  A008: '阴道片',
  A009: '阴道泡腾片',
  A010: '缓释片',
  A011: '控释片',
  A012: '肠溶片',
  A013: '泡腾片',
  A014: '多层片',
  A015: '锭剂',
  A016: '包衣片',
  A017: '薄膜衣片',
  A018: '糖衣片',
  A022: '口腔崩解片',
  A023: '肠溶缓释片',
  A024: '速释片',
  A025: '素片',
  A028: '外用片',
  A029: '口颊片',
  A030: '溶液片',
  A031: '口服冻干片',
  B001: '注射剂',
  B002: '注射液',
  B003: '注射用无菌粉末',
  B004: '注射用浓溶液',
  B005: '注射用溶液剂',
  B006: '静脉滴注用注射液',
  B007: '注射用混悬液',
  B010: '注射用乳剂',
  B011: '粉针剂',
  B012: '针剂',
  B013: '无菌粉针',
  B014: '冻干粉针',
  B015: '微球注射剂',
  B016: '微球注射液',
  B017: '脂质体注射剂',
  B018: '脂质体注射液',
  B019: '微球注射用无菌粉末',
  B020: '透析液',
  C001: '酊剂',
  D001: '栓剂',
  D002: '直肠栓',
  D003: '阴道栓',
  D004: '尿道栓',
  D007: '耳栓',
  D008: '痔疮栓',
  E001: '硬胶囊',
  E002: '软胶囊',
  E003: '缓释胶囊',
  E004: '控释胶囊',
  E005: '肠溶胶囊',
  E006: '阴道胶囊',
  E007: '双释放肠溶胶囊',
  E008: '阴道泡腾胶囊',
  E009: '阴道软胶囊',
  E010: '肠溶微粒胶囊剂',
  F001: '软膏剂',
  F002: '乳膏剂',
  F003: '糊剂',
  F006: '阴道软膏剂',
  F008: '外用乳剂',
  G001: '滴眼剂',
  G002: '洗眼剂',
  G004: '眼膏剂',
  G006: '眼用凝胶剂',
  G010: '滴眼液',
  H001: '丸剂',
  H002: '滴丸',
  H003: '糖丸',
  H012: '缓释丸剂',
  H013: '缓释微丸剂',
  J001: '植入剂',
  J003: '埋植剂',
  J004: '缓释植入剂',
  K001: '糖浆剂',
  K002: '干糖浆剂',
  L001: '气雾剂',
  L002: '喷雾剂',
  L003: '粉雾剂',
  L004: '喷剂',
  L006: '雾化吸入剂',
  L008: '雾化溶液剂',
  L009: '雾化吸入液',
  L010: '吸入性粉剂',
  L012: '干粉吸入剂',
  L013: '粉末吸入剂',
  L015: '吸入性溶液剂',
  L016: '吸入性混悬液',
  L017: '吸入剂',
  M001: '膜剂',
  N001: '颗粒剂',
  N003: '泡腾颗粒',
  N004: '肠溶颗粒',
  N005: '缓释颗粒',
  X001: '口服溶液剂',
  X002: '口服混悬剂',
  X003: '口服乳剂',
  X004: '口服滴剂',
  X005: '合剂',
  X006: '干混悬剂',
  X007: '胶浆剂',
  X008: '口服液',
  X010: '乳剂',
  P001: '口服散剂',
  P002: '局部用散剂',
  P004: '口服粉剂',
  P005: '外用粉剂',
  P007: '撒粉',
  P009: '外用冻干制剂',
  P010: '外用粉末剂',
  P012: '口服冻干粉',
  P013: '外用散剂',
  Q001: '滴耳剂',
  Q009: '耳丸剂',
  Q010: '滴耳液',
  R001: '滴鼻剂',
  R003: '鼻用喷雾剂',
  R008: '鼻用粉雾剂',
  R010: '滴鼻液',
  S001: '洗剂',
  S002: '冲洗剂',
  S003: '灌肠剂',
  S004: '外用溶液剂',
  S006: '含漱液',
  S008: '油剂',
  T001: '搽剂',
  T002: '涂剂',
  T003: '涂膜剂',
  U001: '凝胶剂',
  U002: '乳胶剂',
  U003: '混悬凝胶剂',
  U004: '阴道凝胶剂',
  V001: '贴剂',
  V002: '透皮贴剂',
  V003: '贴膏剂',
  V004: '橡胶膏剂',
  V005: '巴布膏剂',
  W001: '口服常释剂型',
  W002: '缓释控释剂型',
  W003: '口服液体剂',
  W004: '液体剂型',
  W006: '滴剂',
  W007: '外用液体剂',
  W008: '溶液剂',
  W009: '缓控释颗粒剂',
  Z001: '流浸膏剂与浸膏剂',
  Z003: '醑剂',
  Z004: '酏剂',
  Z005: '放射性密封籽源',
  Z006: '敷剂',
  Z007: '宫内节育系统',
  Z008: '海绵剂',
  Z009: '火棉胶剂',
  Z010: '咀嚼胶',
  Z011: '口胶剂',
  Z013: '气体剂',
  Z014: '释氧剂',
  Z015: '药棒剂',
  Z016: '划痕剂',
  Z017: '硬膏剂',
  Z018: '牙周条',
  Z019: '种子源'
}

